sample_app/app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "joseph.leon@loop.colum.edu"], ["LIMIT", 1]]
---
  def create
    user = User.find_by(email: params[:session][:email].downcase)